IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

ENVIRONMENT DIVISION.

DATA DIVISION.

PROCEDURE DIVISION.
    DISPLAY "HELLO WORLD".
    STOP RUN.

*>Alternatively:

IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

ENVIRONMENT DIVISION.

DATA DIVISION.
01 HELLO-WORLD-TXT PIC X(11)

PROCEDURE DIVISION.
    PERFORM HELLO-WORLD.
    STOP RUN.

HELLO-WORLD
    MOVE "HELLO WORLD" TO HELLO-WORLD-TXT.
    DISPLAY HELLO-WORLD-TXT.

*>Alternatively:

IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-MAIN.

ENVIRONMENT DIVISION.

DATA DIVISION.
01 HELLO-WORLD-TXT PIC X(11)

PROCEDURE DIVISION.
    MOVE "HELLO WORLD" TO HELLO-WORLD-TXT.
    CALL HELLO-SUB.
    STOP RUN.

IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-SUB.

ENVIRONMENT DIVISION.

LINKAGE DIVISION.
01 HELLO-WORLD-TXT PIC X(11)

PROCEDURE DIVISION USING HELLO-WORLD-TXT.
    DISPLAY HELLO-WORLD-TXT.
    GOBACK.
