IDENTIFICATION DIVISION
PROGRAM-ID. INDEXFILESAMPLE.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT CASE-FILE
    ASSIGN TO "CASES.DAT"
    ORGANIZATION IS INDEXED
    ACCESS MODE IS RANDOM
    RECORD KEY IS CASE-NUMBER.


DATA DIVISION
WORKING-STORAGE SECTION.
01 SEARCH-CASE-NUMBER PIC 9(6).

FILE SECTION.
FD CASE-FILE.
01 CASE-RECORD.
   05 CASE-NUMBER      PIC 9(6).
   05 CLIENT-NAME      PIC X(30).
   05 CASE-STATUS      PIC X(10).


PROCEDURE DIVISION.
*>less common key read option
READ CASE-FILE
    KEY IS SEARCH-CASE-NUMBER
END-READ


*>more common key read option
READ CASE-FILE
     KEY IS SEARCH-CASE-NUMBER
     INVALID KEY
        DISPLAY "CASE NOT FOUND"
END-READ
STOP-RUN.
