IDENTIFICATION DIVISION.
PROGRAM-ID. CUSTOMER-BALANCE-SORT.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE CONTROL.

   SELECT CUSTOMER-FILE
      ASSIGN TO "CUSTOMER.DAT".

   SELECT HIGHBAL-REPORT
      ASSIGN TO "HIGHBAL.DAT".

   SELECT EXCEPTION-REPORT
      ASSIGN TO "EXCEPTION.DAT".

DATA DIVISION.
FILE SECTION.

FD CUSTOMER-FILE.
   01 CUSTOMER-RECORD.
      05 CUSTOMER-NAME  PIC X(30).
      05 CUSTOMER-BALANCE PIC S9(10)V99. 
*> although our balance upper tier is above 10000, I am allowing for high balances without truncation issues

FD HIGHBAL-REPORT.
   01 HIGHBAL-RECORD.
      05 HIGHBAL-NAME  PIC X(30).
      05 HIGHBAL-BALANCE PIC 9(10)V99. 

FD EXCEPTION-REPORT.
   01 EXCEPTION-RECORD.
      05 EXCEPTION-NAME  PIC X(30).
      05 EXCEPTION-BALANCE PIC 9(10)V99. 

WORKING-STORAGE SECTION.
EOF-FLAG PIC X VALUE "N".
*>alternatively, set no value here, and "MOVE 'N' TO EOF-FLAG" in procedure division instead

PROCEDURE DIVISION.
OPEN INPUT CUSTOMER-FILE.
OPEN OUTPUT HIGHBAL-REPORT.
OPEN OUTPUT EXCEPTION-REPORT.

READ CUSTOMER-FILE
   AT END
      MOVE “Y” TO EOF-FLAG
END-READ.

PERFORM UNTIL EOF-FLAG = "Y"
   EVALUATE TRUE
      WHEN CUSTOMER-BALANCE > 10000
         MOVE CUSTOMER-NAME TO HIGHBAL-NAME
         MOVE CUSTOMER-BALANCE TO HIGHBAL-BALANCE
         WRITE HIGHBAL-REPORT

      WHEN CUSTOMER-NAME = " "
          OR CUSTOMER-BALANCE < 0
             MOVE CUSTOMER-NAME TO EXCEPTION-NAME
             MOVE CUSTOMER-BALANCE TO EXCEPTION-BALANCE
             WRITE EXCEPTION-REPORT

  END-EVALUATE
    
  READ CUSTOMER-FILE
     AT END
        MOVE “Y” TO EOF-FLAG
  END-READ

END-PERFORM.

*> simplifying by not adding DISPLAY-NAME PIC XXXXXXXX “  “ XXXXXXX or DISPLAY BALANCE $ZZZ…Z9.99, but note I would add it to WORKING-STORAGE SECTION and here 

CLOSE CUSTOMER-FILE.
CLOSE HIGHBAL-REPORT.
CLOSE EXCEPTION-REPORT.

STOP RUN.
